In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [3]:
loan_df = pd.read_csv('application_data.csv')

In [12]:
loan_df.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0

In [101]:
loan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Columns: 122 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(41), object(16)
memory usage: 286.2+ MB

In [125]:
#Finding null values in all columns
d = pd.DataFrame(loan_df.isna().sum())
d = d.reset_index()
d.columns = ['col', 'null_values']

In [109]:
#d = d.sort_values(by = 'null_values',ascending=False)

In [126]:
#Drop cols with more than 10% null values
d = d[d['null_values']<=len(loan_df)*0.1]

In [127]:
#Creating new dataframe
loan_df2 = loan_df[d.col]

In [128]:
loan_df2.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_12,FLAG_DOCUMENT_13,FLAG_DOCUMENT_14,FLAG_DOCUMENT_15,FLAG_DOCUMENT_16,FLAG_DOCUMENT_17,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0,0,0,0,0,0,0,0,0,0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0,0,0,0,0,0,0,0,0,0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0,0,0,0,0,0,0,0,0,0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,0,0,0,0,0,0,0,0,0,0
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0,0,0,0,0,0,0,0,0,0

In [129]:
len(loan_df2)

307511

In [130]:
loan_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Data columns (total 65 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   SK_ID_CURR                   307511 non-null  int64
 1   TARGET                       307511 non-null  int64
 2   NAME_CONTRACT_TYPE           307511 non-null  object
 3   CODE_GENDER                  307511 non-null  object
 4   FLAG_OWN_CAR                 307511 non-null  object
 5   FLAG_OWN_REALTY              307511 non-null  object
 6   CNT_CHILDREN                 307511 non-null  int64
 7   AMT_INCOME_TOTAL             307511 non-null  float64
 8   AMT_CREDIT                   307511 non-null  float64
 9   AMT_ANNUITY                  307499 non-null  float64
 10  AMT_GOODS_PRICE              307233 non-null  float64
 11  NAME_TYPE_SUITE              306219 non-null  object
 12  NAME_INCOME_TYPE             307511 non-null  object
 13  NAME_EDUCATION_TYPE          307511 non-null  object
 14  NAME_FAMILY_STATUS           307511 non-null  object
 15  NAME_HOUSING_TYPE            307511 non-null  object
 16  REGION_POPULATION_RELATIVE   307511 non-null  float64
 17  DAYS_BIRTH                   307511 non-null  int64
 18  DAYS_EMPLOYED                307511 non-null  int64
 19  DAYS_REGISTRATION            307511 non-null  float64
 20  DAYS_ID_PUBLISH              307511 non-null  int64
 21  FLAG_MOBIL                   307511 non-null  int64
 22  FLAG_EMP_PHONE               307511 non-null  int64
 23  FLAG_WORK_PHONE              307511 non-null  int64
 24  FLAG_CONT_MOBILE             307511 non-null  int64
 25  FLAG_PHONE                   307511 non-null  int64
 26  FLAG_EMAIL                   307511 non-null  int64
 27  CNT_FAM_MEMBERS              307509 non-null  float64
 28  REGION_RATING_CLIENT         307511 non-null  int64
 29  REGION_RATING_CLIENT_W_CITY  307511 non-null  int64
 30  WEEKDAY_APPR_PROCESS_START   307511 non-null  object
 31  HOUR_APPR_PROCESS_START      307511 non-null  int64
 32  REG_REGION_NOT_LIVE_REGION   307511 non-null  int64
 33  REG_REGION_NOT_WORK_REGION   307511 non-null  int64
 34  LIVE_REGION_NOT_WORK_REGION  307511 non-null  int64
 35  REG_CITY_NOT_LIVE_CITY       307511 non-null  int64
 36  REG_CITY_NOT_WORK_CITY       307511 non-null  int64
 37  LIVE_CITY_NOT_WORK_CITY      307511 non-null  int64
 38  ORGANIZATION_TYPE            307511 non-null  object
 39  EXT_SOURCE_2                 306851 non-null  float64
 40  OBS_30_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 41  DEF_30_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 42  OBS_60_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 43  DEF_60_CNT_SOCIAL_CIRCLE     306490 non-null  float64
 44  DAYS_LAST_PHONE_CHANGE       307510 non-null  float64
 45  FLAG_DOCUMENT_2              307511 non-null  int64
 46  FLAG_DOCUMENT_3              307511 non-null  int64
 47  FLAG_DOCUMENT_4              307511 non-null  int64
 48  FLAG_DOCUMENT_5              307511 non-null  int64
 49  FLAG_DOCUMENT_6              307511 non-null  int64
 50  FLAG_DOCUMENT_7              307511 non-null  int64
 51  FLAG_DOCUMENT_8              307511 non-null  int64
 52  FLAG_DOCUMENT_9              307511 non-null  int64
 53  FLAG_DOCUMENT_10             307511 non-null  int64
 54  FLAG_DOCUMENT_11             307511 non-null  int64
 55  FLAG_DOCUMENT_12             307511 non-null  int64
 56  FLAG_DOCUMENT_13             307511 non-null  int64
 57  FLAG_DOCUMENT_14             307511 non-null  int64
 58  FLAG_DOCUMENT_15             307511 non-null  int64
 59  FLAG_DOCUMENT_16             307511 non-null  int64
 60  FLAG_DOCUMENT_17             307511 non-null  int64
 61  FLAG_DOCUMENT_18             307511 non-null  int64
 62  FLAG_DOCUMENT_19             307511 non-null  int64
 63  FLAG_DOCUMENT_20             307511 non-null  int64
 64  FLAG_DOCUMENT_21             307511 non-null  int64
dtypes: float64(13), int64(41), object(11)
memory usage: 152.5+ MB

In [143]:
#Check duplicates
duplicates = loan_df2.groupby(by='SK_ID_CURR')['SK_ID_CURR'].count().sort_values(ascending = False)
duplicates.head()

SK_ID_CURR
456255    1
218985    1
218987    1
218988    1
218989    1
Name: SK_ID_CURR, dtype: int64

In [138]:
loan_df2['NAME_TYPE_SUITE'].value_counts()

Unaccompanied      248526
Family              40149
Spouse, partner     11370
Children             3267
Other_B              1770
Other_A               866
Group of people       271
Name: NAME_TYPE_SUITE, dtype: int64

In [71]:
# Update Other_A and Other_B as Other
loan_df2['NAME_TYPE_SUITE'] = loan_df2['NAME_TYPE_SUITE'].apply(lambda x : 'Other' if x in ('Other_B','Other_A') else x)

<ipython-input-71-c3e36dceba10>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  loan_df2['NAME_TYPE_SUITE'] = loan_df2['NAME_TYPE_SUITE'].apply(lambda x : 'Other' if x in ('Other_B','Other_A') else x)

In [60]:
loan_df2['NAME_FAMILY_STATUS'].value_counts()

Married                 196432
Single / not married     45444
Civil marriage           29775
Separated                19770
Widow                    16088
Unknown                      2
Name: NAME_FAMILY_STATUS, dtype: int64

In [77]:
#Drop unknown rows
loan_df2 = loan_df2[loan_df2['NAME_FAMILY_STATUS'] != 'Unknown']

In [78]:
loan_df2['NAME_FAMILY_STATUS'].value_counts()

Married                 196432
Single / not married     45444
Civil marriage           29775
Separated                19770
Widow                    16088
Name: NAME_FAMILY_STATUS, dtype: int64

In [82]:
loan_df2['AMT_INCOME_TOTAL'].value_counts()

135000.0    35750
112500.0    31019
157500.0    26556
180000.0    24719
90000.0     22483
            ...
101119.5        1
79425.0         1
101128.5        1
202275.0        1
262174.5        1
Name: AMT_INCOME_TOTAL, Length: 2548, dtype: int64

In [96]:
loan_df2['AMT_ANNUITY'].value_counts()

9000.0     6385
13500.0    5514
6750.0     2279
10125.0    2035
37800.0    1602
           ...
15210.0       1
50265.0       1
73012.5       1
40558.5       1
4437.0        1
Name: AMT_ANNUITY, Length: 13672, dtype: int64

In [87]:
#Drop null rows
loan_df2 = loan_df2.dropna(subset = ['AMT_ANNUITY'])

In [95]:
loan_df2['AMT_GOODS_PRICE'].isnull().sum()

0

In [97]:
loan_df2['AMT_GOODS_PRICE'].median()

450000.0

In [94]:
#Update null rows with median
loan_df2['AMT_GOODS_PRICE'].fillna(value=loan_df2['AMT_GOODS_PRICE'].median(), inplace = True)

C:\Python\anaconda3\lib\site-packages\pandas\core\series.py:4517: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [132]:
loan_df2['NAME_TYPE_SUITE'].value_counts()

Unaccompanied      248526
Family              40149
Spouse, partner     11370
Children             3267
Other_B              1770
Other_A               866
Group of people       271
Name: NAME_TYPE_SUITE, dtype: int64

In [133]:
loan_df2['NAME_TYPE_SUITE'].isnull().sum()

1292